# Exercise 2

In [1]:
import numpy as np
import pandas as pd

<b> Question #1

In [57]:
# list of columns

col_a = ['a','b','c','d']
col_b = np.arange(2,12,3)
col_c = np.arange(1,5)
col_d = np.arange(3,7)
col_e = (np.arange(3,7)*1.0)
col_f = ['h','i','j','k']
col_g = ["2020-01-01 00:00:00-05:00",
         "2020-01-02 00:00:00-05:00", 
         "2020-01-03 00:00:00- 05:00",
         "2020-01-04 00:00:00-05:00"] 
col_h = pd.date_range('2020-01-01', periods=4, freq='N')
col_i = ['True','False','False','True']

In [58]:
# dictionary of lists 

dict = {'column-a':col_a,
        'column-b':col_b,
        'column-c':col_c,
        'column-d':col_d,
        'column-e':col_e,
        'column-f':col_f,
        'column-g':col_g,
        'column-h':col_h,
        'column-i':col_i,}

df = pd.DataFrame(dict)
    
df

,column-a,column-b,column-c,column-d,column-e,column-f,column-g,column-h,column-i
0,a,2,1,3,3.0,h,2020-01-01 00:00:00-05:00,2020-01-01 00:00:00.000000000,True
1,b,5,2,4,4.0,i,2020-01-02 00:00:00-05:00,2020-01-01 00:00:00.000000001,False
2,c,8,3,5,5.0,j,2020-01-03 00:00:00- 05:00,2020-01-01 00:00:00.000000002,False
3,d,11,4,6,6.0,k,2020-01-04 00:00:00-05:00,2020-01-01 00:00:00.000000003,True

<b> Question #2

<b>Task 1:</b>
Mr.Jo Jo likes to do his experiment on small amount of data thus decided to play with only 10 rows.
Read only the rows 3-12 from tweets sheet and name it as "df" and display the type of df.

In [27]:
#Import excel file
#Display rows 3-12 only from tweets sheet

df=pd.read_excel('assignment-data.xlsx',sheet_name='tweets', skiprows=[1,2])
df.head(10)

,tweet_id,created_at,tweet,retweets,username
0,832516558903730176,2017-02-17 09:06:29,@comark yes check the flux capacitor in our lo...,0,88mph_Africa
1,832293187670704128,2017-02-16 18:18:53,RT @iafrikan: .@88mph_Africa stopped running i...,1,88mph_Africa
2,831880802489217024,2017-02-15 15:00:13,88mph invest in Ahoy - a business travel app f...,1,88mph_Africa
3,946063916068634631,2017-12-27 17:03:09,"Ce samedi 30 décembre 2017 à @ActivSpaces, se ...",4,ActiveSpaces
4,945973955847999488,2017-12-27 11:05:41,RT @OIFfrancophonie: Retour en vidéo sur la vi...,27,ActiveSpaces
5,945972004548726785,2017-12-27 10:57:55,RT @OIFfrancophonie: L’OIF a organisé un ateli...,13,ActiveSpaces
6,945606558930690048,2017-12-26 10:45:46,Plus que deux jours et les inscriptions seront...,5,ActiveSpaces
7,945595453256687616,2017-12-26 10:01:39,RT @nlend_nyounai: Transform your idea into a ...,1,ActiveSpaces
8,945595401729724416,2017-12-26 10:01:26,RT @ElongWilliam: Si tu as une idée et tu es u...,6,ActiveSpaces
9,944304498461347840,2017-12-22 20:31:51,RT @chantaledie: AWESOME https://t.co/pTu3k5LA81,2,ActiveSpaces

In [28]:
#Display the type of the dataset

type(df)

pandas.core.frame.DataFrame

In [56]:
#convert "tweet_id" from int to str
df = df.astype({"tweet_id" : str})

#convert "created_at" from object to datetime
df['created_at'] = df['created_at'].astype('datetime64[ns]')
df.dtypes

tweet_id                object
created_at      datetime64[ns]
tweet                   object
retweets                 int64
username                object
new-tweet-id            object
dtype: object

<b>Task 2:</b>
Mr.Jo Jo found that “tweetid, created-at and username” columns are sensitive thus decided to mask the values from those columns. He created new columns “new- tweet-id”,”created-at4” to store the masked “tweet-ids” and masked “created-at” values. He decided to use “username” column to store masked usernames.

In [36]:
#Mask "tweet-ids"

#Use the last 5 digits as the first 5 digits
a = df['tweet_id'].str[-5:]

#Reverse the arrangement of 6-13 digits
b = df['tweet_id'].str[5:13].str[::-1]

#Use the first 5 digits as the last 5 digits
c = df['tweet_id'].str[0:5]

#Create "new-tweet-id" column
df['new-tweet-id'] = df['tweet_id'].mask(df['tweet_id'].notnull(), a+b+c)

In [57]:
#Mask "created-at"

#Deduct 1 year to the dates
date = df['created_at'] - pd.DateOffset(years=1)

#Create "created_at4" column
df['created_at4'] = df['created_at'].mask(df['created_at'].notnull(), date.dt.strftime("%A/%B/%y"))

In [58]:
#Mask "username" column

df['username'] = df['username'].mask(df['username'].notnull(),'yyy')

In [73]:
#Display new columns created and the masked usernames

new = df[['new-tweet-id','created_at4','username']]
shownew = new.head(10)
shownew

         new-tweet-id            created_at4 username
0  301767309855683251  Wednesday/February/16      yyy
1  041287076781383229    Tuesday/February/16      yyy
2  170242984208083188     Monday/February/16      yyy
3  346316860619394606    Tuesday/December/16      yyy
4  994889748559394597    Tuesday/December/16      yyy
5  267857845400294597    Tuesday/December/16      yyy
6  900486039855694560     Monday/December/16      yyy
7  876166652354594559     Monday/December/16      yyy
8  244167927104594559     Monday/December/16      yyy
9  478403164894494430   Thursday/December/16      yyy

<b> Question #3

Data for this question can be found in "online-retail" sheet from assignment- data.xlsx. Since it is a big data, load first 200 rows and keep it in the data frame called "dataset". This “dataset” is used for all tasks in this question

In [2]:
#Import excel file

dataset=pd.read_excel('assignment-data.xlsx',sheet_name='online-retail',nrows=200)
dataset

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom
...,...,...,...,...,...,...,...,...
195,536388,22469,HEART OF WICKER SMALL,12,2010-12-01 09:59:00,1.65,16250,United Kingdom
196,536388,22242,5 HOOK HANGER MAGIC TOADSTOOL,12,2010-12-01 09:59:00,1.65,16250,United Kingdom
197,536389,22941,CHRISTMAS LIGHTS 10 REINDEER,6,2010-12-01 10:03:00,8.50,12431,Australia
198,536389,21622,VINTAGE UNION JACK CUSHION COVER,8,2010-12-01 10:03:00,4.95,12431,Australia
199,536389,21791,VINTAGE HEADS AND TAILS CARD GAME,12,2010-12-01 10:03:00,1.25,12431,Australia

<b>Task 1:</b> When you started working with data, you’ve realized that it needs cleaning to produce better results. Do essential data cleaning.

In [122]:
#Check datatypes of the columns
dataset.dtypes

InvoiceNo              object
StockCode              object
Description            object
Quantity                int64
InvoiceDate    datetime64[ns]
UnitPrice             float64
CustomerID              int64
Country                object
dtype: object

In [155]:
#Check if there are negative values in the int and float data types
#Quantity

dataset[dataset['Quantity'] < 0]

Empty DataFrame
Columns: [InvoiceNo, StockCode, Description, Quantity, InvoiceDate, UnitPrice, CustomerID, Country]
Index: []

In [70]:
#Check if there are negative values in the int and float data types
#Unit Price

dataset[dataset['UnitPrice'] < 0]

Empty DataFrame
Columns: [InvoiceNo, StockCode, Description, Quantity, InvoiceDate, UnitPrice, CustomerID, Country, total_purchase]
Index: []

In [71]:
#Check if there are negative values in the int and float data types
#CustomerID

dataset[dataset['CustomerID'] < 0]

Empty DataFrame
Columns: [InvoiceNo, StockCode, Description, Quantity, InvoiceDate, UnitPrice, CustomerID, Country, total_purchase]
Index: []

<h3> Upon checking, we found that there are ZERO negative values in the INT and FLOAT data types

In [72]:
#To be sure, let's still get the absolute values of the int and float data types

dataset['Quantity'] = abs(dataset['Quantity'])
dataset['UnitPrice'] = abs(dataset['UnitPrice'])
dataset['CustomerID'] = abs(dataset['CustomerID'])

<b>Task 2:</b> Amazon wants to reward the customer who has done the most number of transactions, by providing a gift hamper worth 1000 pesos.
Find out the customer who has done the most number of transactions [Note: One invoice number corresponds to one transaction]. The output should the one as below:

In [146]:
#Use "groupby" to group data by columns
#Since one invoice number corresponds to one transaction,
#we will get the count of InvoiceNo per CustomerID

dataset['customer'] = dataset.groupby(dataset.CustomerID)[['InvoiceNo']].count()

print("Hurray! The most number of transactions is done by Customer ID:", customer.idxmax().get(key='InvoiceNo'),
     ". He has made", customer.max().get('InvoiceNo'), 
      "transactions. He will be rewarded with our gift hamper worth 1000 pesos")

Hurray! The most number of transactions is done by Customer ID: 17850 . He has made 45 transactions. He will be rewarded with our gift hamper worth 1000 pesos

<b>Task 3:</b> Amazon wants to find the best customer and likes to reward 50% discount on his next purchase. Find the Customer with the highest amount of total purchase amount.

In [74]:
#Create a new column for Total Purchase Amount
#Total Purchase Amount = Unit Price * Quantity

dataset['total_purchase'] = np.array(dataset['UnitPrice'].multiply(dataset['Quantity'],axis="index"))

In [154]:
#Use "groupby" to group data by columns
#We will print the CustomerID with the
#highest Total Purchase Amount

cs_amt = dataset.groupby(dataset.CustomerID)[['total_purchase']].sum()

print("Customer ID:", cs_amt.idxmax().get(key='total_purchase'), "is the best customer since he has spent a lot in our business."
     ,"His total purchase amount is", cs_amt.max().get('total_purchase'), "pesos. 50% discount will be given on his next purchase")

Customer ID: 16029 is the best customer since he has spent a lot in our business. His total purchase amount is 3702.12 pesos. 50% discount will be given on his next purchase

<b>Task 4:</b> Amazon wants to find out the most and the least bought items. It likes to increase the sale of least bought item by bundling it with the most bought item and ready to give special 10% discount for this bundle.

In [79]:
#Use "groupby" to group data by columns
#We will determine the most and least bought items
#by getting the sum of their Quantity

items = dataset.groupby(dataset.StockCode)[['Quantity']].sum()

In [78]:
print('Most bought item is StockCode', items.idxmax().get(key='Quantity'), 'with', 
      items.max().get('Quantity'), 'in purhcased quantity.')

print('Least bought item is StockCode', items.idxmin().get(key='Quantity'), 'with', 
      items.min().get('Quantity'), 'in purhcased quantity overall.',
     'These two items can be bundled and provide 10% discount on this bundle to increase the sales of StockCode',
     items.idxmin().get(key='Quantity'))

Most bought item is StockCode 21731 with 458 in purhcased quantity.
Least bought item is StockCode 21166 with 1 in purhcased quantity overall. These two items can be bundled and provide 10% discount on this bundle to increase the sales of StockCode 21166

<b>Task 5:</b> Company likes to find out overall average purchase-amount among all transactions [ one transaction indicates one invoice number]

In [109]:
#In Task 3, we computed the Total Purchase Amount by
#multiplying Unit Price and Quantity
#and stored it on dataset['total_purchase']

#Get the average purchase amount
avg_sale = np.mean(total_purchase)

#Round off the average sale
rounded_avg = round(avg_sale,2)

print("Average purchase amount among all transaction = {}.".format(rounded_avg))

Average purchase amount among all transaction = 44.07.

<b>Task 6:</b> Company also likes to find out the total purchase amount and the number of transactions made by each customer in their lifetime. Create new data frame called "new-dataset", containing the columns ['CustomerID', 'TotalPurchaseAmount', 'NumberofTransactions']. Display the last 10 rows.

In [183]:
#Create new-dataset using Groupby and Aggregate functions

new_dataset = dataset.groupby('CustomerID').agg({'total_purchase':['sum'], 'InvoiceNo': ['count']})
new_dataset.columns = ['TotalPurchaseAmount','NumberofTransactions']

#Use the "tail" function to display the last 10 rows
new_dataset.tail(10)

            TotalPurchaseAmount  NumberofTransactions
CustomerID
15100                    350.40                     1
15291                    328.80                     2
15311                    454.63                    36
16029                   3702.12                     8
16098                    430.60                    12
16250                    226.14                    14
17420                    130.85                     7
17809                     34.80                     1
17850                    725.44                    45
18074                    489.60                    13

<b>Task 7:</b> Company also likes to know average purchase amount made by every customer to get an idea of how much they’ve spent with their business in average. Append a column "AveragePurchase" in the new-dataset. Get the average total purchase per CustomerID. Display first 5 results.

In [203]:
#Compute the "AveragePurchase" by dividing the TotalPurchaseAmount
#by NumberofTransactions
mean_amt = new_dataset['TotalPurchaseAmount']/new_dataset['NumberofTransactions']

#Add "AveragePurchase" column to the new dataset
new_dataset['AveragePurchase'] = mean_amt

#Display the first 5 results
new_dataset.head(5)

            TotalPurchaseAmount  NumberofTransactions  AveragePurchase
CustomerID
12431                    105.60                     3        35.200000
12583                    855.86                    20        42.793000
13047                    366.63                    17        21.566471
13748                    204.00                     1       204.000000
14527                     27.50                     1        27.500000